Ale-maker325/firmware/variants/nrf52840/diy/nRF52840_Ebyte_modems/variant.h
#ifndef _VARIANT_PROMICRO_DIY_
#define _VARIANT_PROMICRO_DIY_

/** Частота опорного генератора схемы синхронизации микроконтроллера (Master clock) */
#define VARIANT_MCK (64000000ul)

// Настройка источника низкочастотного тактирования (LF)
// #define USE_LFXO // Раскомментировать, если на плате установлен внешний кварцевый резонатор 32 кГц
#define USE_LFRC // Плата использует внутреннюю RC-цепочку микроконтроллера для низких частот

#define PROMICRO_DIY_TCXO

/*----------------------------------------------------------------------------
 * Заголовки системных определений  
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

/*
НАЗНАЧЕНИЕ ПИНОВ ДЛЯ МИКРОКОНТРОЛЛЕРА NRF52 PRO MICRO (ФИЗИЧЕСКАЯ СХЕМА ПОДКЛЮЧЕНИЯ)

| Pin   | Функция МК   |     | Pin      | Функция      | RF95 (E32) |
| ----- | ----------- | --- | -------- | ------------ | ---------- |
| Gnd   | Земля       |     | vbat     | Питание бат. |            |
| P0.06 | Serial2 RX  |     | vbat     | Питание бат. |            |
| P0.08 | Serial2 TX  |     | Gnd      | Земля        |            |
| Gnd   | Земля       |     | reset    | Сброс МК     |            |
| Gnd   | Земля       |     | ext_vcc  | Питание пер. | *см. P0.13 |
| P0.17 | RXEN        |     | P0.31    | BATTERY_PIN  | RX_EN      |
| P0.20 | GPS_RX      |     | P0.29    | BUSY / DIO0  | BUSY (DIO0)|
| P0.22 | GPS_TX      |     | P0.02    | MISO         | MISO       |
| P0.24 | GPS_EN      |     | P1.15    | MOSI         | MOSI       |
| P1.00 | BUTTON_PIN  |     | P1.13    | CS           | CS         |
| P0.11 | SCL         |     | P1.11    | SCK          | SCK        |
| P1.04 | SDA         |     | P0.10    | DIO1/IRQ     | DIO1       |
| P1.06 | TXEN        |     | P0.09    | RESET        | RST        |
|       |             |     |          |              |            |
|       | Середина    |     |          | Внутренние   |            |
| P1.01 | Свободный   |     | 0.15     | LED          |            |
| P1.02 | Свободный   |     | 0.13     | 3V3_EN       |            |
| P1.07 | Свободный   |     |          |              |            |
*/

// Общее количество цифровых и аналоговых выводов, определенных в системе
#define PINS_COUNT (48)
#define NUM_DIGITAL_PINS (48)
#define NUM_ANALOG_INPUTS (1)
#define NUM_ANALOG_OUTPUTS (0)

// Управление питанием периферии 3.3V (Вывод P0.13 должен оставаться активным для питания LoRa)
#define PIN_3V3_EN (0 + 13) // P0.13

// ============================================================================
// БЛОК ИЗМЕРЕНИЯ НАПРЯЖЕНИЯ БАТАРЕИ (СПРАВОЧНИК И НАСТРОЙКИ)
// ============================================================================
// Вывод P0.31 служит входом АЦП (аналого-цифрового преобразователя) для контроля батареи
#define BATTERY_PIN (0 + 31) 
#define ADC_CHANNEL ADC1_GPIO4_CHANNEL
#define ADC_RESOLUTION 14
#define BATTERY_SENSE_RESOLUTION_BITS 12
#define BATTERY_SENSE_RESOLUTION 4096.0

// Опорное напряжение АЦП установлено на 3.0 Вольта (максимум, что может измерить пин)
#undef AREF_VOLTAGE
#define AREF_VOLTAGE 3.0
#define VBAT_AR_INTERNAL AR_INTERNAL_3_0

// Расчет базовой цены одного шага АЦП (в милливольтах): 3000 мВ / 4096 шагов = 0.7324 мВ
#define VBAT_MV_PER_LSB (0.73242188F)

/*
 * ----------------------------------------------------------------------------
 * СПРАВОЧНАЯ ТАБЛИЦА РЕЗИСТОРНЫХ ДЕЛИТЕЛЕЙ (СОХРАНИТЬ ДЛЯ ПАЙКИ ПЛАТЫ!)
 * ----------------------------------------------------------------------------
 * Как это работает: Напряжение батареи (8.4В или 12.6В) слишком высокое для чипа.
 * Мы ставим два резистора: R1 (от плюса батареи к пину P0.31) и R2 (от пина P0.31 к GND земли).
 * 
 * ВАЖНОЕ ПРАВИЛО ДЛЯ ДЕТЕЙ И ВЗРОСЛЫХ:
 * Параллельно резистору R2 (между пином P0.31 и Землей) ОБЯЗАТЕЛЬНО припаяйте керамический
 * конденсатор на 100 нФ (0.1 мкФ). Он уберет все шумы и сделает измерения идеально точными!
 *
 * | Батарея | Макс. вольт | R1 (к Плюсу) | R2 (к Земле) | Вольт на АЦП | Утечка тока | Рекомендация |
 * | ------- | ----------- | ------------ | ------------ | ------------ | ----------- | ------------ |
 * | 2S LiPo | 8.4 В       | 470 кОм      | 220 кОм      | 2.68 В       | 12.2 мкА    | ОПТИМАЛЬНО   |
 * | 2S LiPo | 8.4 В       | 1 МОм        | 470 кОм      | 2.68 В       | 5.7 мкА     | Микро-ток    |
 * | 2S LiPo | 8.4 В       | 200 кОм      | 100 кОм      | 2.80 В       | 28.0 мкА    | Без кондера  |
 * | 3S LiPo | 12.6 В      | 1 МОм        | 270 кОм      | 2.68 В       | 9.9 мкА     | ОПТИМАЛЬНО   |
 * | 3S LiPo | 12.6 В      | 2.2 МОм      | 680 кОм      | 2.97 В       | 4.4 мкА     | Микро-ток    |
 * | 3S LiPo | 12.6 В      | 330 кОм      | 100 кОм      | 2.93 В       | 29.3 мкА    | Без кондера  |
 * ----------------------------------------------------------------------------
 */

// ============================================================================
// ПЕРЕКЛЮЧАТЕЛЬ ТИПА БАТАРЕИ (ИНСТРУКЦИЯ ПО КОМПИЛЯЦИИ)
// ============================================================================
// Если вы используете батарею из ДВУХ последовательных банок (2S, до 8.4 В),
// оставьте раскомментированной строку: #define BATTERY_2S_18650
//
// Если вы используете батарею из ТРЕХ последовательных банок (3S, до 12.6 В),
// ЗАКОММЕНТИРУЙТЕ строку 2S (поставьте // в начале) и РАСКОММЕНТИРУЙТЕ строку 3S.
// ============================================================================

//#define BATTERY_2S_18650    // <-- АКТИВНО СЕЙЧАС (Для батарей 2S 18650)
#define BATTERY_3S_18650 // <-- ЗАКОММЕНТИРОВАНО (Для батарей 3S 18650)

// ----------------------------------------------------------------------------
// МАТЕМАТИЧЕСКИЕ РАСЧЕТЫ (ВЫПОЛНЯЮТСЯ КОМПИЛЯТОРОМ АВТОМАТИЧЕСКИ)
// ----------------------------------------------------------------------------
#ifdef BATTERY_2S_18650
    // Настройки для оптимального делителя 2S: R1 = 470 кОм (подключается к плюсу батареи), R2 = 220 кОм (подключается к земле)
    #define VBAT_DIVIDER (0.3188F)          // Коэффициент деления: 220 / (470 + 220)
    #define VBAT_DIVIDER_COMP (3.13636F)    // Полный множитель делителя: (470 + 220) / 220
    
    // ТРЮК "ВИРТУАЛЬНЫЙ 1S": Мы делим множитель на 2 (число банок в батарее 2S).
    // Благодаря этому прошивка думает, что подключена обычная батарея (до 4.2 В),
    // и приложение Meshtastic на телефоне будет ИДЕАЛЬНО показывать проценты заряда (0-100%)
    // без каких-либо сложных настроек со стороны пользователя и детей!
    //Если тебе важнее видеть на экране истинные 8 Вольт, то можно убрать деление на 2, но тогда проценты заряда будут показываться некорректно.
    // #define ADC_MULTIPLIER (VBAT_DIVIDER_COMP / 2.0F)
    #define ADC_MULTIPLIER VBAT_DIVIDER_COMP

#elif defined(BATTERY_3S_18650)
    // Настройки для оптимального делителя 3S: R1 = 1 МОм (1000 кОм) (подключается к плюсу батареи), R2 = 270 кОм (подключается к земле)
    #define VBAT_DIVIDER (0.2126F)          // Коэффициент деления: 270 / (1000 + 270)
    #define VBAT_DIVIDER_COMP (4.70370F)    // Полный множитель делителя: (1000 + 270) / 270
    
    // ТРЮК "ВИРТУАЛЬНЫЙ 1S": Делим множитель на 3 (число банок в батарее 3S).
    // Проценты заряда на экране телефона и в телеметрии будут отображаться корректно от 0 до 100%.
    // #define ADC_MULTIPLIER (VBAT_DIVIDER_COMP / 3.0F)
    

#else
    // Защита от случайной ошибки: если пользователь забыл выбрать тип батареи,
    // компилятор выдаст понятную ошибку на русском языке и остановит сборку!
    #error "ВНИМАНИЕ! Выберите тип батареи в файле variant.h: раскомментируйте BATTERY_2S_18650 или BATTERY_3S_18650!"
#endif

// Итоговый расчет реального напряжения для ядра прошивки Meshtastic
#define REAL_VBAT_MV_PER_LSB (ADC_MULTIPLIER * VBAT_MV_PER_LSB)
#define VBAT_RAW_TO_SCALED(x) (REAL_VBAT_MV_PER_LSB * x)
// ============================================================================
// КОНЕЦ БЛОКА ИЗМЕРЕНИЯ НАПРЯЖЕНИЯ БАТАРЕИ
// ============================================================================


// Конфигурация аппаратного интерфейса I2C (Шина Wire)
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE_SDA (32 + 4) // Линия данных SDA назначена на вывод P1.04
#define PIN_WIRE_SCL (0 + 11) // Линия тактирования SCL назначена на вывод P0.11

// Параметры встроенного системного светодиода
#define PIN_LED1 (0 + 15) // Вывод P0.15 (физически красный светодиод на плате)
#define LED_BUILTIN PIN_LED1
#define LED_BLUE PIN_LED1
#define LED_STATE_ON 1 // Уровень логической единицы включает светодиод

// Конфигурация аппаратной кнопки управления пользовательского интерфейса
#define BUTTON_PIN (32 + 0) // Вывод P1.00

// Конфигурация интерфейса подключения GPS-модуля
#define PIN_GPS_TX (0 + 22) // Вывод P0.22 (Передача данных со стороны МК к GPS)
#define PIN_GPS_RX (0 + 20) // Вывод P0.20 (Прием данных МК от GPS модуля)
#define PIN_GPS_EN (0 + 24) // Вывод P0.24 (Управление ключом питания GPS-модуля)
#define GPS_UBLOX

// Конфигурация аппаратных интерфейсов UART (последовательные порты)
#define PIN_SERIAL1_RX PIN_GPS_TX
#define PIN_SERIAL1_TX PIN_GPS_RX
#define PIN_SERIAL2_RX (0 + 6) // Вывод P0.06
#define PIN_SERIAL2_TX (0 + 8) // Вывод P0.08

// Конфигурация аппаратной шины SPI для обмена данными с LoRa модемом
#define SPI_INTERFACES_COUNT 1
#define PIN_SPI_MISO (0 + 2)   // Линия ввода данных SPI на выводе P0.02
#define PIN_SPI_MOSI (32 + 15) // Линия вывода данных SPI на выводе P1.15
#define PIN_SPI_SCK (32 + 11)  // Линия тактирования шины SPI на выводе P1.11

// Системные привязки линий SPI, используемые ядром связи прошивки
#define LORA_MISO PIN_SPI_MISO
#define LORA_MOSI PIN_SPI_MOSI
#define LORA_SCK PIN_SPI_SCK
#define LORA_CS (32 + 13) // Вывод выбора кристалла трансивера CS на P1.13

// ============================================================================
// ПОДДЕРЖИВАЕМЫЕ СЕРИИ LORA МОДЕМОВ В СИСТЕМЕ
// ============================================================================
//#define USE_LLCC68
#define USE_SX1262
//#define USE_RF95 // Данный дефайн активирует блок настроек под ваш текущий чип SX1278 (E32)
#define USE_SX1268
//#define USE_LR1121

// ----------------------------------------------------------------------------
// АКТУАЛЬНАЯ КОНФИГУРАЦИЯ: Блок настроек для RF95 / SX127x (Модем E32)
// ----------------------------------------------------------------------------
#define LORA_DIO0 (0 + 29) // Вывод P0.29 — Линия BUSY / Аппаратное прерывание пакетов (DIO0 модема)
#define LORA_DIO1 (0 + 10) // Вывод P0.10 — Аппаратное прерывание таймаутов (DIO1 модема)
#define LORA_RESET (0 + 9) // Вывод P0.09 — Линия аппаратного сброса трансивера (RST модема)

// Конфигурация раздельного управления внешним РЧ-переключателем трансивера E32
#ifdef USE_RF95
    #define RF95_RXEN (0 + 17) // Вывод P0.17 — Управление линией приема RX_EN (высокий уровень активирует прием пакетов)
    #define RF95_TXEN (32 + 6) // Вывод P1.06 — Управление линией передачи TX_EN (свободный пин боковой гребенки)
#endif

// ----------------------------------------------------------------------------
// РЕЗЕРВНАЯ КОНФИГУРАЦИЯ: Блок настроек для серии SX126X
// ----------------------------------------------------------------------------
#define SX126X_CS (32 + 13)      // Линия CS на выводе P1.13
#define SX126X_DIO1 (0 + 10)     // Линия прерывания IRQ на выводе P0.10
#define SX126X_DIO2_AS_RF_SWITCH // Автоматическое переключение РЧ через внутренний DIO2 самого чипа
#define SX126X_BUSY (0 + 29)     // Контроль состояния занятости BUSY на выводе P0.29
#define SX126X_RESET (0 + 9)     // Линия сброса на выводе P0.09
#define SX126X_RXEN (0 + 17)     // Линия приема RX_EN на выводе P0.17
#define SX126X_TXEN RADIOLIB_NC  // Для чипов SX126x управление передачей осуществляется аппаратно через DIO2

// ----------------------------------------------------------------------------
// РЕЗЕРВНАЯ КОНФИГУРАЦИЯ: Блок настроек для серии LR1121
// ----------------------------------------------------------------------------
#ifdef USE_LR1121
#define LR1121_IRQ_PIN (0 + 10)      // Прерывание на P0.10
#define LR1121_NRESET_PIN LORA_RESET // Сброс трансивера на P0.09
#define LR1121_BUSY_PIN (0 + 29)     // Контроль занятости BUSY на P0.29
#define LR1121_SPI_NSS_PIN LORA_CS   // Выбор чипа CS на P1.13
#define LR1121_SPI_SCK_PIN LORA_SCK
#define LR1121_SPI_MOSI_PIN LORA_MOSI
#define LR1121_SPI_MISO_PIN LORA_MISO
#define LR11X0_DIO3_TCXO_VOLTAGE 1.8
#define LR11X0_DIO_AS_RF_SWITCH
#endif

// Настройка питания внешнего высокостабильного генератора (TCXO) для совместимых модулей
#define SX126X_DIO3_TCXO_VOLTAGE 1.8
#define TCXO_OPTIONAL // Позволяет прошивке на лету пробовать запускать радиомодули как с TCXO, так и с XTAL кварцем


#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 * Объекты среды Arduino - только для С++ компилятора
 *----------------------------------------------------------------------------*/

#endif // _VARIANT_PROMICRO_DIY_